app/controllers/dashboard_controller.rb

SELECT  "participants".* FROM "participants" WHERE "participants"."user_id" = $1 AND "participants"."project_id" = $2  ORDER BY "participants"."id" ASC LIMIT 1  [["user_id", 1], ["project_id", 1]]
---
  def set_current_user_participation
      @current_user_participation = current_user.current_project_participant(@project.id)
      if @current_user_participation.blank?