app/controllers/project_dates_controller.rb

  def index
    @project_dates = ProjectDate.all
---
SELECT "project_dates".* FROM "project_dates"