app/controllers/project_restrictions_controller.rb

  def index
    @project_restrictions = ProjectRestriction.all
---
SELECT "project_restrictions".* FROM "project_restrictions"